package ref;

public class VarChange1 {
    public static void main(String[] args) {

        // 기본형 vs 참조형 1

        /*
        * 변수의 데이터 타입에는 크게 두가지로 나뉜다.
        * 1. 기본형
        * - 실제 사용하는 값을 변수에 담을 수 있다.
        * - 해당 값 바로 사용 가능하다.
        * - 들어있는 값을 그대로 계산에 사용할 수 있다. (연산 가능하다.)
        * - 기본형은 소문자로 시작한다.
        * 2. 참조형
        * - 실제 사용하는 값을 변수에 담는것이 아니다.
        * - 실제 객체의 위치를 저장한다. 대표적으로 객체(.)와 배열[]이 있다.
        * - 들어있는 참조값을 그대로 사용할 수 없다. 주소지만 가지고는 할 수 있는게 없다. (연산 불가능하다.)
        * - 클래스는 대문자로 시작한다.
        * - String 은 사실은 클래스다. 따라서 참조형이다.
        * */
    }
}
